IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultOverallItem
Overal check item

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultOverallItem.#ctor
Constructor

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultOverallItem.ResultType
Check result type

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultOverallItem.Result
check result passed/failed

IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultOverallItem.CheckValue
calculated limited value, calculated as strain to limit strain